import Title from "../UI/Title";
import RulesItem from "./RulesItem";
import { GoClockFill } from "react-icons/go";
import { MdCancel } from "react-icons/md";
import { GiConfirmed } from "react-icons/gi";

const Rules = () => {
    return (
        <section id='rules' className="items-start">
            <div className="wrapper gap-14 ">
                <Title>ПРАВИЛА ШКОЛИ</Title>
                <h2 className="text-2xl">Хочемо ознайомити вас з політикою скасувань та переносів уроків.</h2>
                <div className="w-full flex flex-col gap-12 text-xl items-center">
                    <RulesItem icon={<GoClockFill/>}>Для **переносу** уроку вам потрібно написати викладачу **мінімум за 1 годину** до початку уроку, пізніше з вчителем ви можете домовитись про інший день відпрацювання цього заняття.</RulesItem>
                    <RulesItem icon={<MdCancel/>}>**Скасувати** повністю урок можна **мінімум за 3 годин** до заняття, у такому випадку ваш урок будемо відмінено та кошти за урок не стягуватимуться. Проте, якщо ви забули про урок або не повідомили викладача щодо скасування або переносу заняття, то цей урок рахується проведеним і оплата за нього стягується.</RulesItem>
                    <RulesItem icon={<GiConfirmed/>}>Просимо цінувати вчителя і ваш час. І просимо відповідально ставитись до навчання, оскільки інтенсивність = результат!</RulesItem>
                </div>
            </div>
        </section>
    )
}


export default Rules;


// ### Хочемо ознайомити вас з політикою скасувань та переносів уроків.

// Для **переносу** уроку вам потрібно написати викладачу **мінімум за 1 годину** до початку уроку, пізніше з вчителем ви можете домовитись про інший день відпрацювання цього заняття.

// **Скасувати** повністю урок можна **мінімум за 3 годин** до заняття, у такому випадку ваш урок будемо відмінено та кошти за урок не стягуватимуться. Проте, якщо ви забули про урок або не повідомили викладача щодо скасування або переносу заняття, то цей урок рахується проведеним і оплата за нього стягується.

// Просимо цінувати вчителя і ваш час. І просимо відповідально ставитись до навчання, оскільки інтенсивність = результат!